---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyDistance
source: html/74402cc6-a08c-d23c-fb8e-2165a0ec4a1f.htm
---
# AssetPropertyDistance Methods

Adds a new connected asset attached to this asset property, if it allows it.